# bml assignment 3
PRITHIKA.V
21UAI067

In [ ]:
# import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt

In [13]:
import pandas as pd
df = pd.read_csv("D:\salary_prediction.csv")
df

   experience  test_score  interview_score  salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [14]:
import math
med_testscore = math.floor(df.test_score.median())
med_testscore

8

In [15]:
median_experience = math.floor(df.experience.median())
median_experience

6

In [16]:
df.experience = df.experience.fillna(median_experience)
df

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [17]:
import pandas as pd
df.test_score = df.test_score.fillna(med_testscore)
df

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [19]:
from sklearn import linear_model
reg  = linear_model.LinearRegression()
reg.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression()

In [20]:
reg.coef_

array([2813.00813008, 1333.33333333, 2926.82926829])

In [21]:
reg.intercept_

11869.91869918695

In [22]:
reg.predict([[2,9,6]])

E:\New folder\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([47056.91056911])